package by.academyy.Cycles;
//Даны натуральные числа от 20 до 50.Напечатать те из них, которые делятся на 3, но не делятся на 5.

public class Task8 {
	public static void main(String[] args) {
		for (int n = 20; n<51; n++) {
			if (n%3==0 & n%5!=0)
		
		System.out.println(n);
	}

}
}